MikroElektronika/core_packages/PIC/XC8/def/PIC16F18876/mcu.h
// Register: SMT2CPWL
#define SMT2CPWL SMT2CPWL
extern volatile unsigned char           SMT2CPWL            __at(0x512);
#ifndef _LIB_BUILD
asm("SMT2CPWL equ 0512h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW0                   :1;
        unsigned CPW1                   :1;
        unsigned CPW2                   :1;
        unsigned CPW3                   :1;
        unsigned CPW4                   :1;
        unsigned CPW5                   :1;
        unsigned CPW6                   :1;
        unsigned CPW7                   :1;
    };
    struct {
        unsigned SMT2CPW                :8;
    };
    struct {
        unsigned SMT2CPW0               :1;
        unsigned SMT2CPW1               :1;
        unsigned SMT2CPW2               :1;
        unsigned SMT2CPW3               :1;
        unsigned SMT2CPW4               :1;
        unsigned SMT2CPW5               :1;
        unsigned SMT2CPW6               :1;
        unsigned SMT2CPW7               :1;
    };
} SMT2CPWLbits_t;
extern volatile SMT2CPWLbits_t SMT2CPWLbits __at(0x512);
// bitfield macros
#define _SMT2CPWL_CPW_POSN                                  0x0
#define _SMT2CPWL_CPW_POSITION                              0x0
#define _SMT2CPWL_CPW_SIZE                                  0x8
#define _SMT2CPWL_CPW_LENGTH                                0x8
#define _SMT2CPWL_CPW_MASK                                  0xFF
#define _SMT2CPWL_CPW0_POSN                                 0x0
#define _SMT2CPWL_CPW0_POSITION                             0x0
#define _SMT2CPWL_CPW0_SIZE                                 0x1
#define _SMT2CPWL_CPW0_LENGTH                               0x1
#define _SMT2CPWL_CPW0_MASK                                 0x1
#define _SMT2CPWL_CPW1_POSN                                 0x1
#define _SMT2CPWL_CPW1_POSITION                             0x1
#define _SMT2CPWL_CPW1_SIZE                                 0x1
#define _SMT2CPWL_CPW1_LENGTH                               0x1
#define _SMT2CPWL_CPW1_MASK                                 0x2
#define _SMT2CPWL_CPW2_POSN                                 0x2
#define _SMT2CPWL_CPW2_POSITION                             0x2
#define _SMT2CPWL_CPW2_SIZE                                 0x1
#define _SMT2CPWL_CPW2_LENGTH                               0x1
#define _SMT2CPWL_CPW2_MASK                                 0x4
#define _SMT2CPWL_CPW3_POSN                                 0x3
#define _SMT2CPWL_CPW3_POSITION                             0x3
#define _SMT2CPWL_CPW3_SIZE                                 0x1
#define _SMT2CPWL_CPW3_LENGTH                               0x1
#define _SMT2CPWL_CPW3_MASK                                 0x8
#define _SMT2CPWL_CPW4_POSN                                 0x4
#define _SMT2CPWL_CPW4_POSITION                             0x4
#define _SMT2CPWL_CPW4_SIZE                                 0x1
#define _SMT2CPWL_CPW4_LENGTH                               0x1
#define _SMT2CPWL_CPW4_MASK                                 0x10
#define _SMT2CPWL_CPW5_POSN                                 0x5
#define _SMT2CPWL_CPW5_POSITION                             0x5
#define _SMT2CPWL_CPW5_SIZE                                 0x1
#define _SMT2CPWL_CPW5_LENGTH                               0x1
#define _SMT2CPWL_CPW5_MASK                                 0x20
#define _SMT2CPWL_CPW6_POSN                                 0x6
#define _SMT2CPWL_CPW6_POSITION                             0x6
#define _SMT2CPWL_CPW6_SIZE                                 0x1
#define _SMT2CPWL_CPW6_LENGTH                               0x1
#define _SMT2CPWL_CPW6_MASK                                 0x40
#define _SMT2CPWL_CPW7_POSN                                 0x7
#define _SMT2CPWL_CPW7_POSITION                             0x7
#define _SMT2CPWL_CPW7_SIZE                                 0x1
#define _SMT2CPWL_CPW7_LENGTH                               0x1
#define _SMT2CPWL_CPW7_MASK                                 0x80
#define _SMT2CPWL_SMT2CPW_POSN                              0x0
#define _SMT2CPWL_SMT2CPW_POSITION                          0x0
#define _SMT2CPWL_SMT2CPW_SIZE                              0x8
#define _SMT2CPWL_SMT2CPW_LENGTH                            0x8
#define _SMT2CPWL_SMT2CPW_MASK                              0xFF
#define _SMT2CPWL_SMT2CPW0_POSN                             0x0
#define _SMT2CPWL_SMT2CPW0_POSITION                         0x0
#define _SMT2CPWL_SMT2CPW0_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW0_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW0_MASK                             0x1
#define _SMT2CPWL_SMT2CPW1_POSN                             0x1
#define _SMT2CPWL_SMT2CPW1_POSITION                         0x1
#define _SMT2CPWL_SMT2CPW1_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW1_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW1_MASK                             0x2
#define _SMT2CPWL_SMT2CPW2_POSN                             0x2
#define _SMT2CPWL_SMT2CPW2_POSITION                         0x2
#define _SMT2CPWL_SMT2CPW2_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW2_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW2_MASK                             0x4
#define _SMT2CPWL_SMT2CPW3_POSN                             0x3
#define _SMT2CPWL_SMT2CPW3_POSITION                         0x3
#define _SMT2CPWL_SMT2CPW3_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW3_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW3_MASK                             0x8
#define _SMT2CPWL_SMT2CPW4_POSN                             0x4
#define _SMT2CPWL_SMT2CPW4_POSITION                         0x4
#define _SMT2CPWL_SMT2CPW4_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW4_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW4_MASK                             0x10
#define _SMT2CPWL_SMT2CPW5_POSN                             0x5
#define _SMT2CPWL_SMT2CPW5_POSITION                         0x5
#define _SMT2CPWL_SMT2CPW5_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW5_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW5_MASK                             0x20
#define _SMT2CPWL_SMT2CPW6_POSN                             0x6
#define _SMT2CPWL_SMT2CPW6_POSITION                         0x6
#define _SMT2CPWL_SMT2CPW6_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW6_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW6_MASK                             0x40
#define _SMT2CPWL_SMT2CPW7_POSN                             0x7
#define _SMT2CPWL_SMT2CPW7_POSITION                         0x7
#define _SMT2CPWL_SMT2CPW7_SIZE                             0x1
#define _SMT2CPWL_SMT2CPW7_LENGTH                           0x1
#define _SMT2CPWL_SMT2CPW7_MASK                             0x80

// Register: SMT2CPWH
#define SMT2CPWH SMT2CPWH
extern volatile unsigned char           SMT2CPWH            __at(0x513);
#ifndef _LIB_BUILD
asm("SMT2CPWH equ 0513h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW8                   :1;
        unsigned CPW9                   :1;
        unsigned CPW10                  :1;
        unsigned CPW11                  :1;
        unsigned CPW12                  :1;
        unsigned CPW13                  :1;
        unsigned CPW14                  :1;
        unsigned CPW15                  :1;
    };
    struct {
        unsigned SMT2CPW                :8;
    };
    struct {
        unsigned SMT2CPW8               :1;
        unsigned SMT2CPW9               :1;
        unsigned SMT2CPW10              :1;
        unsigned SMT2CPW11              :1;
        unsigned SMT2CPW12              :1;
        unsigned SMT2CPW13              :1;
        unsigned SMT2CPW14              :1;
        unsigned SMT2CPW15              :1;
    };
} SMT2CPWHbits_t;
extern volatile SMT2CPWHbits_t SMT2CPWHbits __at(0x513);
// bitfield macros
#define _SMT2CPWH_CPW_POSN                                  0x0
#define _SMT2CPWH_CPW_POSITION                              0x0
#define _SMT2CPWH_CPW_SIZE                                  0x8
#define _SMT2CPWH_CPW_LENGTH                                0x8
#define _SMT2CPWH_CPW_MASK                                  0xFF
#define _SMT2CPWH_CPW8_POSN                                 0x0
#define _SMT2CPWH_CPW8_POSITION                             0x0
#define _SMT2CPWH_CPW8_SIZE                                 0x1
#define _SMT2CPWH_CPW8_LENGTH                               0x1
#define _SMT2CPWH_CPW8_MASK                                 0x1
#define _SMT2CPWH_CPW9_POSN                                 0x1
#define _SMT2CPWH_CPW9_POSITION                             0x1
#define _SMT2CPWH_CPW9_SIZE                                 0x1
#define _SMT2CPWH_CPW9_LENGTH                               0x1
#define _SMT2CPWH_CPW9_MASK                                 0x2
#define _SMT2CPWH_CPW10_POSN                                0x2
#define _SMT2CPWH_CPW10_POSITION                            0x2
#define _SMT2CPWH_CPW10_SIZE                                0x1
#define _SMT2CPWH_CPW10_LENGTH                              0x1
#define _SMT2CPWH_CPW10_MASK                                0x4
#define _SMT2CPWH_CPW11_POSN                                0x3
#define _SMT2CPWH_CPW11_POSITION                            0x3
#define _SMT2CPWH_CPW11_SIZE                                0x1
#define _SMT2CPWH_CPW11_LENGTH                              0x1
#define _SMT2CPWH_CPW11_MASK                                0x8
#define _SMT2CPWH_CPW12_POSN                                0x4
#define _SMT2CPWH_CPW12_POSITION                            0x4
#define _SMT2CPWH_CPW12_SIZE                                0x1
#define _SMT2CPWH_CPW12_LENGTH                              0x1
#define _SMT2CPWH_CPW12_MASK                                0x10
#define _SMT2CPWH_CPW13_POSN                                0x5
#define _SMT2CPWH_CPW13_POSITION                            0x5
#define _SMT2CPWH_CPW13_SIZE                                0x1
#define _SMT2CPWH_CPW13_LENGTH                              0x1
#define _SMT2CPWH_CPW13_MASK                                0x20
#define _SMT2CPWH_CPW14_POSN                                0x6
#define _SMT2CPWH_CPW14_POSITION                            0x6
#define _SMT2CPWH_CPW14_SIZE                                0x1
#define _SMT2CPWH_CPW14_LENGTH                              0x1
#define _SMT2CPWH_CPW14_MASK                                0x40
#define _SMT2CPWH_CPW15_POSN                                0x7
#define _SMT2CPWH_CPW15_POSITION                            0x7
#define _SMT2CPWH_CPW15_SIZE                                0x1
#define _SMT2CPWH_CPW15_LENGTH                              0x1
#define _SMT2CPWH_CPW15_MASK                                0x80
#define _SMT2CPWH_SMT2CPW_POSN                              0x0
#define _SMT2CPWH_SMT2CPW_POSITION                          0x0
#define _SMT2CPWH_SMT2CPW_SIZE                              0x8
#define _SMT2CPWH_SMT2CPW_LENGTH                            0x8
#define _SMT2CPWH_SMT2CPW_MASK                              0xFF
#define _SMT2CPWH_SMT2CPW8_POSN                             0x0
#define _SMT2CPWH_SMT2CPW8_POSITION                         0x0
#define _SMT2CPWH_SMT2CPW8_SIZE                             0x1
#define _SMT2CPWH_SMT2CPW8_LENGTH                           0x1
#define _SMT2CPWH_SMT2CPW8_MASK                             0x1
#define _SMT2CPWH_SMT2CPW9_POSN                             0x1
#define _SMT2CPWH_SMT2CPW9_POSITION                         0x1
#define _SMT2CPWH_SMT2CPW9_SIZE                             0x1
#define _SMT2CPWH_SMT2CPW9_LENGTH                           0x1
#define _SMT2CPWH_SMT2CPW9_MASK                             0x2
#define _SMT2CPWH_SMT2CPW10_POSN                            0x2
#define _SMT2CPWH_SMT2CPW10_POSITION                        0x2
#define _SMT2CPWH_SMT2CPW10_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW10_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW10_MASK                            0x4
#define _SMT2CPWH_SMT2CPW11_POSN                            0x3
#define _SMT2CPWH_SMT2CPW11_POSITION                        0x3
#define _SMT2CPWH_SMT2CPW11_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW11_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW11_MASK                            0x8
#define _SMT2CPWH_SMT2CPW12_POSN                            0x4
#define _SMT2CPWH_SMT2CPW12_POSITION                        0x4
#define _SMT2CPWH_SMT2CPW12_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW12_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW12_MASK                            0x10
#define _SMT2CPWH_SMT2CPW13_POSN                            0x5
#define _SMT2CPWH_SMT2CPW13_POSITION                        0x5
#define _SMT2CPWH_SMT2CPW13_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW13_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW13_MASK                            0x20
#define _SMT2CPWH_SMT2CPW14_POSN                            0x6
#define _SMT2CPWH_SMT2CPW14_POSITION                        0x6
#define _SMT2CPWH_SMT2CPW14_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW14_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW14_MASK                            0x40
#define _SMT2CPWH_SMT2CPW15_POSN                            0x7
#define _SMT2CPWH_SMT2CPW15_POSITION                        0x7
#define _SMT2CPWH_SMT2CPW15_SIZE                            0x1
#define _SMT2CPWH_SMT2CPW15_LENGTH                          0x1
#define _SMT2CPWH_SMT2CPW15_MASK                            0x80

