MikroElektronika/core_packages/PIC/XC8/def/PIC16F18876/mcu.h
extern volatile CCDPDbits_t CCDPDbits __at(0xF62);
// bitfield macros
#define _CCDPD_CCDPD0_POSN                                  0x0
#define _CCDPD_CCDPD0_POSITION                              0x0
#define _CCDPD_CCDPD0_SIZE                                  0x1
#define _CCDPD_CCDPD0_LENGTH                                0x1
#define _CCDPD_CCDPD0_MASK                                  0x1
#define _CCDPD_CCDPD1_POSN                                  0x1
#define _CCDPD_CCDPD1_POSITION                              0x1
#define _CCDPD_CCDPD1_SIZE                                  0x1
#define _CCDPD_CCDPD1_LENGTH                                0x1
#define _CCDPD_CCDPD1_MASK                                  0x2
#define _CCDPD_CCDPD2_POSN                                  0x2
#define _CCDPD_CCDPD2_POSITION                              0x2
#define _CCDPD_CCDPD2_SIZE                                  0x1
#define _CCDPD_CCDPD2_LENGTH                                0x1
#define _CCDPD_CCDPD2_MASK                                  0x4
#define _CCDPD_CCDPD3_POSN                                  0x3
#define _CCDPD_CCDPD3_POSITION                              0x3
#define _CCDPD_CCDPD3_SIZE                                  0x1
#define _CCDPD_CCDPD3_LENGTH                                0x1
#define _CCDPD_CCDPD3_MASK                                  0x8
#define _CCDPD_CCDPD4_POSN                                  0x4
#define _CCDPD_CCDPD4_POSITION                              0x4
#define _CCDPD_CCDPD4_SIZE                                  0x1
#define _CCDPD_CCDPD4_LENGTH                                0x1
#define _CCDPD_CCDPD4_MASK                                  0x10
#define _CCDPD_CCDPD5_POSN                                  0x5
#define _CCDPD_CCDPD5_POSITION                              0x5
#define _CCDPD_CCDPD5_SIZE                                  0x1
#define _CCDPD_CCDPD5_LENGTH                                0x1
#define _CCDPD_CCDPD5_MASK                                  0x20
#define _CCDPD_CCDPD6_POSN                                  0x6
#define _CCDPD_CCDPD6_POSITION                              0x6
#define _CCDPD_CCDPD6_SIZE                                  0x1
#define _CCDPD_CCDPD6_LENGTH                                0x1
#define _CCDPD_CCDPD6_MASK                                  0x40
#define _CCDPD_CCDPD7_POSN                                  0x7
#define _CCDPD_CCDPD7_POSITION                              0x7
#define _CCDPD_CCDPD7_SIZE                                  0x1
#define _CCDPD_CCDPD7_LENGTH                                0x1
#define _CCDPD_CCDPD7_MASK                                  0x80

// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0xF64);
#ifndef _LIB_BUILD
asm("ANSELE equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSE0                  :1;
        unsigned ANSE1                  :1;
        unsigned ANSE2                  :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0xF64);
// bitfield macros
#define _ANSELE_ANSE0_POSN                                  0x0
#define _ANSELE_ANSE0_POSITION                              0x0
#define _ANSELE_ANSE0_SIZE                                  0x1
#define _ANSELE_ANSE0_LENGTH                                0x1
#define _ANSELE_ANSE0_MASK                                  0x1
#define _ANSELE_ANSE1_POSN                                  0x1
#define _ANSELE_ANSE1_POSITION                              0x1
#define _ANSELE_ANSE1_SIZE                                  0x1
#define _ANSELE_ANSE1_LENGTH                                0x1
#define _ANSELE_ANSE1_MASK                                  0x2
#define _ANSELE_ANSE2_POSN                                  0x2
#define _ANSELE_ANSE2_POSITION                              0x2
#define _ANSELE_ANSE2_SIZE                                  0x1
#define _ANSELE_ANSE2_LENGTH                                0x1
#define _ANSELE_ANSE2_MASK                                  0x4

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0xF65);
#ifndef _LIB_BUILD
asm("WPUE equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUE0                  :1;
        unsigned WPUE1                  :1;
        unsigned WPUE2                  :1;
        unsigned WPUE3                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0xF65);
// bitfield macros
#define _WPUE_WPUE0_POSN                                    0x0
#define _WPUE_WPUE0_POSITION                                0x0
#define _WPUE_WPUE0_SIZE                                    0x1
#define _WPUE_WPUE0_LENGTH                                  0x1
#define _WPUE_WPUE0_MASK                                    0x1
#define _WPUE_WPUE1_POSN                                    0x1
#define _WPUE_WPUE1_POSITION                                0x1
#define _WPUE_WPUE1_SIZE                                    0x1
#define _WPUE_WPUE1_LENGTH                                  0x1
#define _WPUE_WPUE1_MASK                                    0x2
#define _WPUE_WPUE2_POSN                                    0x2
#define _WPUE_WPUE2_POSITION                                0x2
#define _WPUE_WPUE2_SIZE                                    0x1
#define _WPUE_WPUE2_LENGTH                                  0x1
#define _WPUE_WPUE2_MASK                                    0x4
#define _WPUE_WPUE3_POSN                                    0x3
#define _WPUE_WPUE3_POSITION                                0x3
#define _WPUE_WPUE3_SIZE                                    0x1
#define _WPUE_WPUE3_LENGTH                                  0x1
#define _WPUE_WPUE3_MASK                                    0x8

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0xF66);
#ifndef _LIB_BUILD
asm("ODCONE equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCE0                  :1;
        unsigned ODCE1                  :1;
        unsigned ODCE2                  :1;
    };
} ODCONEbits_t;
extern volatile ODCONEbits_t ODCONEbits __at(0xF66);
// bitfield macros
#define _ODCONE_ODCE0_POSN                                  0x0
#define _ODCONE_ODCE0_POSITION                              0x0
#define _ODCONE_ODCE0_SIZE                                  0x1
#define _ODCONE_ODCE0_LENGTH                                0x1
#define _ODCONE_ODCE0_MASK                                  0x1
#define _ODCONE_ODCE1_POSN                                  0x1
#define _ODCONE_ODCE1_POSITION                              0x1
#define _ODCONE_ODCE1_SIZE                                  0x1
#define _ODCONE_ODCE1_LENGTH                                0x1
#define _ODCONE_ODCE1_MASK                                  0x2
#define _ODCONE_ODCE2_POSN                                  0x2
#define _ODCONE_ODCE2_POSITION                              0x2
#define _ODCONE_ODCE2_SIZE                                  0x1
#define _ODCONE_ODCE2_LENGTH                                0x1
#define _ODCONE_ODCE2_MASK                                  0x4

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0xF67);
#ifndef _LIB_BUILD
asm("SLRCONE equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned SLRE2                  :1;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0xF67);
// bitfield macros
#define _SLRCONE_SLRE0_POSN                                 0x0
#define _SLRCONE_SLRE0_POSITION                             0x0
#define _SLRCONE_SLRE0_SIZE                                 0x1
#define _SLRCONE_SLRE0_LENGTH                               0x1
#define _SLRCONE_SLRE0_MASK                                 0x1
#define _SLRCONE_SLRE1_POSN                                 0x1
#define _SLRCONE_SLRE1_POSITION                             0x1
#define _SLRCONE_SLRE1_SIZE                                 0x1
#define _SLRCONE_SLRE1_LENGTH                               0x1
#define _SLRCONE_SLRE1_MASK                                 0x2
#define _SLRCONE_SLRE2_POSN                                 0x2
#define _SLRCONE_SLRE2_POSITION                             0x2
#define _SLRCONE_SLRE2_SIZE                                 0x1
#define _SLRCONE_SLRE2_LENGTH                               0x1
#define _SLRCONE_SLRE2_MASK                                 0x4

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0xF68);
#ifndef _LIB_BUILD
asm("INLVLE equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned INLVLE2                :1;
        unsigned INLVLE3                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0xF68);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0xF69);
#ifndef _LIB_BUILD
asm("IOCEP equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0xF69);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0xF6A);
#ifndef _LIB_BUILD
asm("IOCEN equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0xF6A);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

